Revit 2027 API
BuiltInFailures.DimensionFailures.DimensionUnlockedAndUnequaled Property
 Dimension had to be unlocked in order to remove sketch over-constraining.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DimensionUnlockedAndUnequaled { get; }
Public Shared ReadOnly Property DimensionUnlockedAndUnequaled As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DimensionUnlockedAndUnequaled {
	FailureDefinitionId^ get ();
}
static member DimensionUnlockedAndUnequaled : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace